package com.mostainahmed.discoverkhulna.places;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.GridLayoutManager;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.View;
import android.widget.ImageView;

import com.mostainahmed.discoverkhulna.R;

import java.util.ArrayList;
import java.util.List;

public class PlacesActivity extends AppCompatActivity {

    RecyclerView recyclerView;
    ImageView backButton;
    List<Places> placesList;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_places);

        recyclerView = findViewById(R.id.recyclerView);
        backButton = findViewById(R.id.img_back);
        recyclerView.setHasFixedSize(true);
        recyclerView.setLayoutManager(new LinearLayoutManager(this));

        placesList = new ArrayList<>();

        addPlacesList();

        PlacesAdapter adapter = new PlacesAdapter(this, placesList);
        recyclerView.setAdapter(adapter);
        backButton.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                onBackPressed();
            }
        });
    }

    private void addPlacesList() {

        placesList.add(
                new Places(
                        1,
                        "সুন্দরবন",
                        "বাংলাদেশের অংশ ৬,০১৭ বর্গ কি.মি.আয়তনের সুন্দরবন বিশ্বের বৃহত্তম ব-দ্বীপ, দীর্ঘতম লবণাক্ত জলাভূমি এবং জীব বৈচিত্র্যে সমৃদ্ধ একটি অতি গুরুত্বপূর্ণ ইকোসিস্টেম। এখানে ৩৩৪ প্রজাতির উদ্ভিদ এবং ৩৭৫ প্রজাতির বন্যপ্রাণী বিদ্যমান, যার মধ্যে আছে ৩৫ প্রজাতির সরীসৃপ, ৩১৫ প্রজাতির পাখি, ৪২ প্রজাতির স্তন্যপায়ী প্রাণী এবং বিশ্ব বিখ্যাত রয়েল বেঙ্গল টাইগার। প্রধান সরীসৃপ জাতিগুলোর মধ্যে আছে নোনা পানির কুমির, অজগর, গোখরা, গুইসাপ, সামুদ্রিক সাপ, গিরগিটি, কচ্ছপ এবং অন্যান্য। প্রায় ৩০ প্রজাতির সাপ সুন্দরবনে পাওয়া যায়। জলাভূমি হিসাবে রামসার এলাকার সকল বৈশিষ্ট্য বিদ্যমান থাকায় সুন্দরবনকে ১৯৯২ সালে ৫৬০ তম রামসার এলাকা হিসাবে যোষণা করা হয়েছে। ১৯৯৭ সালে ইউনেস্কো সুন্দরবনকে ওয়ার্ল্ড হেরিটেজ সাইট হিসেবে ঘোষণা করে।",
                        "নদী পথে : খুলনা লঞ্চঘাট খেকে লঞ্চযোগে সুন্দর বন যাওয়া যাবে। রাতে ও সকালে লঞ্চ রয়েছে। সড়ক পথে : খুলনা খেকে বাসযোগে কয়রা হয়ে সুন্দরবন যাওয়া যায়।",
                        R.drawable.sundarbantwo,
                        R.drawable.sundarbanone,
                        R.drawable.sundarbanthree,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        2,
                        "বীরশ্রেষ্ঠ রুহুল আমিনের সমাধি",
                        "১৯৭১ সালে রূপসা নদীতীরবর্তী খুলনা শিপইয়ার্ডের সামনে বীরশ্রেষ্ঠ রুহুল আমিন শহীদ হন। তাকে বাগমারা নামক গ্রামে সমাহিত করা হয়। বর্তমানে দেড় একর জমি নিয়ে বীরশ্রেষ্ঠ রুহুল আমিন এবং বীরবিক্রম মহিবুল্লাহর সমাধি কমপ্লেক্স নির্মিত হয়েছে। ২০০৩ সালে জেলা প্রশাসনের উদ্যোগে নতুন করে সমাধিসৌধের সংস্কার করা হয়।",
                        "খুলনা থেকে বাসে রূপসা উপজেলায় পৌঁছে স্থানীয় যানবাহনে বাগমারা গ্রামে যাওয়া যায়।",
                        R.drawable.ruhultwo,
                        R.drawable.ruhulone,
                        R.drawable.ruhulthree,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        3,
                        "শিরোমণি স্মৃতিসৌধ",
                        "মুক্তিযুদ্ধে খুলনার বীরত্বগাথার স্মৃতিবিজড়িত আরেকটি স্থান শিরোমণি। ১৯৭১ সালের ১৬ ডিসেম্বর বাংলাদেশ স্বাধীন হলেও খুলনা স্বাধীন হয়েছিল এক দিন পর ১৭ ডিসেম্বর ১৯৭১ তারিখে। খুলনা শিরোমণি কৌশলগত যু্দ্ধজয়ের এক অনন্য স্থান হিসেবে স্থান করে নিয়েছে বিশ্বইতিহাসে। এখানে একটি স্মৃতিসৌধ স্থাপন করা হয়েছে।শিরোমণি স্মৃতিসৌধ বাংলাদেশের মুক্তিযুদ্ধের এক গৌরবোজ্জ্বল ইতিহাসের সাক্ষী হয়ে আছে। স্বাধীনতা যুদ্ধের সময় এখানে যে যুদ্ধ সংঘটিত হয় তা শিরোমণি ট্যাঙ্ক যুদ্ধ (এটি কিছু ক্ষেত্রে \"শিরোমণি সম্মুখ সমর\" নামেও পরিচিত) হিসেবে খ্যাত। ১৬ ডিসেম্বর (১৯৭১) জেনারেল নিয়াজী তার সৈন্যবাহিনী নিয়ে জনসম্মুখে রেসকোর্স ময়দানে আত্মসমর্পণ করেন এবং ঠিক ওই সময় ব্রিগেডিয়ার হায়াত খানের নেতৃত্বে ৪ সহস্রাধিক সৈন্যের বিরুদ্ধে মুক্তিবাহিনী ও ভারতীয় সেনারা \"শিরোমণি ট্যাঙ্ক যুদ্ধ\" নামের বৃহৎ প্রতিরোধের যুদ্ধে মুখোমুখি হয়। এ যুদ্ধের কৌশল ভারত, পোল্যান্ডসহ ৩৫টি দেশের সেনাবাহিনীর প্রতিরক্ষা কলেজে পড়ানো হয়, বিশ্বের সেরা কিছু ট্যাংক যুদ্ধের মধ্যে শিরোমণি ট্যাঙ্ক যুদ্ধ একটি এবং একই সাথে বাংলাদেশের স্বাধীনতা যুদ্ধের শেষ যুদ্ধক্ষেত্র এই শিরোমণি।",
                        "hello",
                        R.drawable.shiromonione,
                        R.drawable.shiromonitwo,
                        R.drawable.shiromonithree,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        4,
                        "গল্লামারী বধ্যভূমি",
                        "মুক্তিযুদ্ধের ভয়াবহ গণহত্যার স্মৃতি বিজড়িত আরেকটি স্থান গল্লামারী। খুলনা বিশ্ববিদ্যালয়ের সন্নিকটে ময়ূর নদীর তীরে অবস্থিত এই গল্লামারী। ১৯৭১ এর মহান মুক্তিযুদ্ধে খুলনা অঞ্চলের অন্যতম বধ্যভূমি। তৎকালীন পূর্ব পাকিস্তান রেডিও স্টেশন (গল্লামারী রেডিও সেন্টার) ভবনে মুক্তিযোদ্ধা ও মুক্তিকামী মানুষদের ধরে এনে নির্মম নির্যাতন করে হত্যাকরে গল্লামারী নদীতে ফেলে দেয়া হতো। শহরের দু'কিলোমিটার অভ্যন্তরে গল্লামারী খালের পাশে এই বধ্যভূমির অবস্থান।খুলনা শহর মুক্ত হবার পর গল্লামারী খাল ও এর আশপাশের স্থান থেকে প্রায় পাঁচ ট্রাক ভর্তি মানুষের মাথার খুলি ও হাড়গোড় পাওয়া যায়। ধারণা করা হয় ঐ স্থানে আনুমানিক ১৫ হাজার মানুষ হত্যা করা হয়। স্বাধীনতার পর রেডিও সেন্টার (বর্তমান বাংলাদেশ বেতার, খুলনা কেন্দ্র) নগরীর নূরনগর এলাকায় স্থানান্তরিত হয়েছে। সেখানে ১৯৯৫ সালে প্রথম একটি স্মৃতিস্তম্ভ তৈরি করা হয়।",
                        "খুলনা শহরের সোনাডাঙ্গা বাসস্ট্যান্ড থেকে রিক্সা কিংবা অটোরিক্সায় যাওয়া যায়।",
                        R.drawable.gollamarione,
                        R.drawable.gollamaritwo,
                        R.drawable.gollamarithree,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        5,
                        "কবি কৃষ্ণচন্দ্র ইনস্টিটিউট",
                        "সাহিত্যিক ও সাংবাদিক কবি কৃষ্ণচন্দ্র মজুমদার সেনহাটি ইউনিয়নের সেনহাটি গ্রামে জন্মগ্রহণ করেন। তাঁর স্মৃতি বিজড়িত স্থান এবং ব্যবহার্য জিনিস পত্র নিয়ে তৈরি করা হয়েছে কবি কৃষ্ণচন্দ্র মজুমদার ইনস্টিটিউট জাদুঘর।কৃষ্ণচন্দ্র ১৮৫৪ সালে বরিশালের কীর্তিপাশা বাংলা বিদ্যালয়ের প্রধান পন্ডিতপদে যোগদানের মাধ্যমে কর্মজীবন শুরু করেন। পরে তিনি ঢাকার নর্মাল স্কুলে যোগদান করেন, কিন্তু কর্তৃপক্ষের সঙ্গে মতবিরোধ হওয়ায় চাকরি ছেড়ে তিনি মডেল স্কুলে (১৮৬০) যোগ দেন। এভাবে তিনি বিভিন্ন স্কুলে দীর্ঘ উনিশ বছর শিক্ষকতা করেন। পেশাগত দায়িত্ব পালনে তিনি ছিলেন খুবই নিষ্ঠাবান। অনেক কীর্তিমান ব্যক্তি তাঁর ছাত্র ছিলেন।কৃষ্ণচন্দ্রের বিখ্যাত কাব্যগ্রন্থ ‘সদ্ভাবশতক’ প্রকাশিত হয় ১৮৬১ সালে। তাই পরিণত বয়সে তিনি ‘রামের ইতিবৃত্ত’ (১৮৬৮) নামে একটি আত্মচরিত রচনা করেন। মহাভারতের ‘বাসব-নহুষ-সংবাদ’ অবলম্বনে রচিত তাঁর অপর গ্রন্থ হলো ‘মোহভোগ’ (১৮৭১) কৈবল্যতত্ত্ব (১৮৮৩) তাঁর একটি দর্শন বিষয়ক গ্রন্থ। মৃত্যুর পরে প্রকাশিত হয় তাঁর নাটক ‘রাবণবধ’। এ ছাড়া তাঁর অপ্রকাশিত গ্রন্থের সংখ্যা পনেরো। তাঁর রচনা প্রসাদগুণসম্পন্ন এবং তাঁর কবিতার অনেক পঙ্তি প্রবাদ বাক্যস্বরূপ, যেমন: ‘চিরসুখী জন ভ্রমে কি কখন ব্যথিত বেদন বুঝিতে পারে’, ‘যে জন দিবসে মনের হরষে’, ‘কাঁটা হেরি ক্ষান্ত কেন হে’ ইত্যাদি। এ পঙ্তিধারী কবিতাটি এক সময় স্কুলপাঠ্য বইয়ের অন্তর্ভুক্ত ছিল।কৃষ্ণচন্দ্র সম্পাদিত পত্রিকাগুলোর মধ্যে উল্লেখযোগ্য মনোরঞ্জিকা, কবিতা কুসুমাবলী ও দ্বৈভাষিকী। শেষ জীবনে কৃষ্ণচন্দ্র সেনহাটিতে বসবাস করেন এবং বিবিধ রকমের সঙ্গীত রচনা করে অবসর জীবন কাটান। ১৯০৭ সালের ১৩ জানুয়ারি তাঁর মৃত্যু হয়।",
                        "খুলনা জেলার দিঘলিয়া উপজেলার সেনহাটি ইউনিয়ন বাজারের প্রাণকেন্দ্রে কবি কৃষ্ণচন্দ্র ইনস্টিটিউটের অবস্থান। খুলনা জেলা থেকে সড়ক পথ বা নদী পথে সেনহাটি বাজার আসা যায়। এছাড়া দিঘলিয়া উপজেলা থেকে সড়ক পথে ভ্যান/ইজিবাইক যোগে সেনহাটি বাজারে আসা যায়।",
                        R.drawable.krishnaone,
                        R.drawable.krishnatwo,
                        R.drawable.krishnathree,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        6,
                        "বকুলতলা (জেলা প্রশাসকের বাংলো)",
                        "বাংলা সাহিত্যের প্রবাদপুরুষ ঔপন্যাসিক বঙ্কিমচন্দ্র চট্টোপাধ্যায়-এর স্মৃতিধণ্য খুলনার জেলা প্রশাসকের বাংলো। ১৮৬০-১৮৬৪ সালে কবি বঙ্কিমচন্দ্র খুলনার ডেপুটি ম্যাজিস্ট্রেট ও ডেপুটি কালেক্টর থাকাকালীন সময়ে এই বাংলোই ছিল তাঁর বাসস্থান। ভৈরব নদের তীরে অবস্থিত এই বাংলোর বকুলতলায় বসেই কবি রচনা করেছিলেন তাঁর বিখ্যাত উপন্যাস এবং বাংলা সাহিত্যের প্রথম প্রেমের উপন্যাস ‘কপালকুন্ডলা’।",
                        "খুলনা শহরে রূপসা নদীর তীরে জেলা প্রশাসক মহোদয়ের বাংলো। জেলা প্রশাসক মহোদয়ের উদারতায় যে কোন সময় পরিদর্শনের অনুমতি পাওয়া যায়।",
                        R.drawable.bokulone,
                        R.drawable.bokultwo,
                        R.drawable.bokulthree,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        7,
                        "স্যার পি.সি. রায়ের বাড়ি",
                        "খুলনা জেলার পাইকগাছা উপজেলার রাড়ুলী গ্রামে আচার্য প্রফুল্ল চন্দ্র রায়ের বাড়ি অবস্থিত। জনশ্রুতি অনুযায়ী ১৮৫০ ইং সনে আচার্য প্রফুল্ল চন্দ্র রায়ের পিতা হরিশ চন্দ্র রায় রাড়ুলী গ্রামে স্থায়ীভাবে বসবাসের জন্য একটি বসত বাড়ি নির্মাণ করেন। আচার্য প্রফুল্ল চন্দ্র রায়ের পিতা ১৮৫০ ইং সনে গ্রামের বালিকাদের লেখাপড়ার জন্য তার স্ত্রী ভূবন মোহিনীর নামে একটি বালিকা বিদ্যালয় স্থাপন করেন। এটাই খুলনা জেলার সর্ব প্রথম বালিকা বিদ্যালয়। স্থানীয় জনগণের ধারণা, হরিশ চন্দ্র রায় যে বছর তার স্ত্রীর নামে বালিকা বিদ্যালয় স্থাপন করেন সেই বছরই তিনি এই বাড়িটি নির্মাণ করেন। হরিশ চন্দ্র রায়ের পাকা বাড়িটি দুটি ভাগে বিভক্ত। একটি সদর মহল অপরটি অন্দর মহল। আচার্য প্রফুল্ল চন্দ্র রায়ের লেখা আত্মচরিত হতে জানা যায় সদর মহলটি পুরুষদের বসবাসের জন্য নির্মাণ করা হয় এবং অন্দর মহলটি মহিলাদের বসবাসের জন্য নির্মাণ করা হয়।জনশ্রুতি হতে জানা যায় এই অন্দরমহলেই আচার্য প্রফুল্ল চন্দ্র রায় ১৮৬১ ইং সনে ২রা আগস্ট জন্মগ্রহণ করেন। এই অন্দরমহলটি সদর মহলের অনুরূপ স্থাপত্য নকশায় নির্মিত। আচার্য প্রফুল্ল চন্দ্র রায়ের ভ্রাতুষ্পুত্র বাবুচারণ চন্দ্র রায় চৌধুরী ১৯৮২ ইং সনে বাংলাদেশ ত্যাগ করবার সময় পর্যন্ত উক্ত বাড়িতে বসবাস করতেন।",
                        "খুলনা থেকে বাসে পাইকগাছা যাবার পথে, রাড়ুলী পাইকগাছা সংযোগ সড়কে নেমে, সেখান থেকে রিক্সা কিংবা অটোরিক্সায় যাওয়া যায়",
                        R.drawable.pcthree,
                        R.drawable.pctwo,
                        R.drawable.pcone,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        8,
                        "রবীন্দ্রনাথ ঠাকুরের পূর্বপুরুষের বসতভিটা",
                        "বিশ্ব কবি রবীন্দ্রনাথ ঠাকুরের পূর্বপুরুষের বাস্তুভিটা হিসাবেখ্যাত কুশারী বাড়ি রূপসা উপজেলার ৫নং ঘাটভোগ ইউনিয়নের অন্তর্গত পিঠাভোগ গ্রামে অবস্থিত। নওয়াপাড়া বিশ্বরোড থেকে ৭কি.মি. দক্ষিণে অগ্রসর হয়ে পিঠাভোগ কাজদিয়া সেতু পার হয়ে ১কি.মি. পূর্বে ঘাটভোগ ইউনিয়ন পরিষদের পাকা রাস্তা ধরে খানিকটা অগ্রসর হয়ে প্রাচীন ভৈরব নদীর ৪০০ফুট উত্তর পাড়েই বিশ্ব কবি রবীন্দ্রনাথ ঠাকুরের পূর্বপুরুষের বসতভিটা কুশারী বাড়ির অবস্থান। ২০১৫ সালে প্রত্নতত্ত্ব অধিদপ্তর কর্তৃক কবি গুরুর পূর্বপুরুষের বাস্তুভিটাকে ১৯৬৮ সালের (সংশোধিত ১৯৭৬ইং) প্রত্নতাত্ত্বিক আইনের আওতায় সংরক্ষিত পুরাকীর্তি ঘোষণা করা হয়।",
                        "খুলনা থেকে বাসে রূপসা উপজেলায় গিয়ে সেখান থেকে স্থানীয় যানবাহন পাওয়া যায়।",
                        R.drawable.robione,
                        R.drawable.robithree,
                        R.drawable.robitwo,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        9,
                        "রবীন্দ্রনাথ ঠাকুরের শ্বশুর বাড়ি",
                        "খুলনা জেলার ফুলতলা উপজেলাস্থ দক্ষিণডিহিতে বিশ্ব কবি রবীন্দ্রনাথ ঠাকুরের শ্বশুরালয় অবস্থিত। রবীন্দ্রনাথ ঠাকুরের শ্বশুরালয় দক্ষিণডিহির দ্বিতল ভবনটি খুলনা যশোর পাকা সড়কের বেজেরডাঙ্গা বাস স্টপের এক মাইল পূর্বে অবস্থিত। এই দ্বিতল ভবনের উপর একটি চিলে কোঠা রয়েছে। মূলভবনের নীচতলায় ৪টি এবং দ্বিতীয় তলায় ২টি কক্ষ রয়েছে। দক্ষিণ দিকে একটি বারান্দা আছে। ভবনের স্থাপত্য ও গঠন কাঠামোতে বৃটিশ যুগের স্থাপত্যরীতির প্রভাব সুস্পষ্ট। সম্ভবত উনবিংশ শতাব্দীর শেষদিকে এই ভবন নির্মিত হয়েছিল।",
                        "খুলনা থেকে বাসে ফুলতলা উপজেলায় গিয়ে, সেখান থেকে অটোরিক্সা কিংবা স্থানীয় বাহনে যাওয়া যায়",
                        R.drawable.robisoshurone,
                        R.drawable.robisoshurtwo,
                        R.drawable.robisoshurthree,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        10,
                        "সুন্দরবনের কটকা",
                        "সুন্দরবনের দক্ষিণ পূর্বকোণে অবস্থিত কটকা। সুন্দর বনের আকর্ষনীয় স্থান গুলোর মধ্যে অন্যতম এ কটকা। মংলাবন্দর থেকে প্রায় ৯০কিঃমিঃ দূরে অবস্থিত । এখানে বন বিভাগের একটি রেস্ট হাউস আছে। সামনেই দেখা যায় সাগরের অথৈ জল রাশির বিশাল বিশাল ঢেউ। এর আশ পাশে রয়েছে অসংখ্য ছোট বড় খাল। এসব খালে নৌকা নিয়ে ভ্রমন খুবই মজাদার। প্রকৃতির রূপ ও বিচিত্র রহস্যময় অভিজ্ঞতা অর্জনের এক অপুর্ব সুযোগ। খালের ধারে দেখা যায় দলে দলে চিত্রল হরিণ চরে বেড়াতে। এছাড়া বানর, উদবিড়াল ও বন মোরগ দেখা যায়। মাঝে মাঝে বাঘের গর্জনও শোনা যায়। অন্ধকার রাতে লক্ষ কোটি জোনাকীর আলোর মেলা মুগ্ধ ও বিমোহিত করে তোলে। সব মিলিয়ে কটকা একটি সৌন্দর্য উপভোগ করার স্থান।",
                        "নদী পথে : খুলনা লঞ্চঘাট খেকে লঞ্চযোগে কটকা যাওয়া যাবে। রাতে ও সকালে লঞ্চ রয়েছে।",
                        R.drawable.kotkathree,
                        R.drawable.kotkatwo,
                        R.drawable.kotkaone,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        11,
                        "সুন্দরবনের দুবলার চর",
                        "চাঁদপাই রেঞ্জের আরেকটি গুরুত্বপূর্ণ জায়গা দুবলার চর। কুঙ্গা ও মরা পশুর নদের মাঝে দুবলা একটি বিচ্ছিন্ন দ্বীপ। এখানে লাল বুক মাছরাঙা, মদনটাক পাখির দেখা মেলে। এখানকার সৌন্দর্যের একটি দিক হচ্ছে হরিণের ঘাস খাবার দৃশ্য। দুবলার চর মূলত জেলে গ্রাম। মাছ ধরার সঙ্গে চলে শুঁটকি শোকানোর কাজ। বর্ষা মৌসুমের ইলিশ শিকারের পর বহু জেলে চার মাসের জন্য সুদূর কক্সবাজার, চট্টগ্রাম, বাগেরহাট, পিরোজপুর, খুলনা, সাতক্ষীরা থেকে ডেরা বেঁধে সাময়িক বসতি গড়ে সেখানে। মেহেরআলীর খাল, আলোরকোল, মাঝেরচর, অফিসকেল্লা, নারিকেলবাড়িয়া, মানিকখালী, ছাফরাখালী ও শ্যালারচর ইত্যাদি এলাকায় জেলে পল্লী স্থাপিত হয়। এই চার মাস তারা মাছকে শুঁটকি বানাতে ব্যস্ত থাকেন। এখান থেকে আহরিত শুঁটকি চট্টগ্রামের আসাদগঞ্জের পাইকারী বাজারে মজুদ ও বিক্রয় করা হয়। সুন্দরবনের পূর্ব বিভাগের সদর দপ্তর বাগেরহাট থেকে মাছ সংগ্রহের পূর্বানুমতিসাপেক্ষে বহরদার ও জেলেরা দুবলার চরে প্রবেশ করে থাকেন। দুবলার চর থেকে সরকার নিয়মিত হারে রাজস্ব পেয়ে থাকে। প্রতি বছর বিএলসি বা বোট লাইসেন্স সার্টিফিকেট, ডিএফসি বা ডেইলি ফুয়েল (জ্বালানি কাঠ) কঞ্জামশন ইত্যাদি প্রক্রিয়ায় বন বিভাগকে রাজস্ব প্রদান করে মৎস্য ব্যবসায়ীগণ সুন্দরবনে ঢোকার অনুমতি পান, এছাড়া আহরিত শুঁটকি মাছ পরিমাপ করে নিয়ে ফিরে আসার সময় মাছভেদে প্রদান করেন নির্ধারিত রাজস্ব।প্রতি বছর কার্তিক মাসে (খ্রিস্টীয় নভেম্বর) হিন্দু ধর্মাবলম্বীদের রাসমেলা এবং পূণ্যস্নানের জন্যও দ্বীপটি বিখ্যাত। যদিও বলা হয়ে থাকে, ২০০ বছর ধরে এ রাসমেলা হয়ে চলেছে , তবে জানা যায়, ১৯২৩ খ্রিস্টাব্দে হরিচাঁদ ঠাকুরের এক বনবাসী ভক্ত, নাম হরিভজন (১৮২৯—১৯২৩), এই মেলা চালু করেন। প্রতিবছর অসংখ্য পুণ্যার্থী রাসপূর্ণিমাকে উপলক্ষ করে এখানে সমুদ্রস্নান করতে আসেন। দুবলার চরে সূর্যোদয় দেখে ভক্তরা সমুদ্রের জলে ফল ভাসিয়ে দেন। কেউবা আবার বাদ্যযন্ত্র বাজিয়ে ভজন-কীর্তন গেয়ে মুখরিত করেন চারপাশ। দুবলার চরের রাসমেলায় স্থানীয় লোকজন ছাড়াও দূর-দূরান্তের শহরবাসী এমনকি বিদেশি পর্যটকেরাও স্বতঃস্ফূর্তভাবে অংশ নিয়ে থাকেন। তিনদিনব্যাপী এ মেলায় অনেক বিদেশী পর্যটকেরও সমাগম হয়।",
                        "নদী পথে : খুলনা লঞ্চঘাট খেকে লঞ্চযোগে সুন্দরবনের দুবলার চর যাওয়া যাবে। রাতে ও সকালে লঞ্চ রয়েছে।",
                        R.drawable.dublaone,
                        R.drawable.dublatwo,
                        R.drawable.dublathree,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        12,
                        "সুন্দরবনের হিরণ পয়েন্ট",
                        "হিরণ পয়েন্ট, সুন্দরবনের দক্ষিণাংশের একটি সংরক্ষিত অভয়ারণ্য। এর আরেক নাম নীলকমল। প্রমত্তা কুঙ্গা নদীর পশ্চিম তীরে, খুলনা রেঞ্জে এর অবস্থান। হিরণ পয়েন্ট ইউনেস্কো ঘোষিত অন্যতম একটি বিশ্ব ঐতিহ্য। হিরণ পয়েন্ট একটি অভয়ারণ্য হওয়ায় এই স্থান অনেক বাঘ, হরিণ, বানর, পাখি এবং সরিসৃপের নিরাপদ আবসস্থল। সুন্দরবন এলাকায় রয়েল বেঙ্গল টাইগার দেখার অন্যতম একটি স্থান হলো এই হিরণ পয়েন্ট। এখানে দেখা পাওয়া যায় চিত্রা হরিণ, বন্য শুকরের; পাখিদের মধ্যে আছে সাদা বুক মাছরাঙা, হলুদ বুক মাছরাঙা, কালোমাথা মাছরাঙা, লার্জ এগ্রেট, কাঁদা খোঁচা, ধ্যানী বক প্রভৃতি। এছাড়া আছে প্রচুর কাঁকড়ার আবাস। আর আছে রঙ-বেরঙের প্রজাপতি। হিরণ পয়েন্ট থেকে ৩ কিলোমিটার দূরে কেওড়াসুঠিতে রয়েছে একটি ওয়াচ টাওয়ার।",
                        "নদী পথে : খুলনা লঞ্চঘাট খেকে লঞ্চযোগে সুন্দরবনের হিরণপয়েন্ট যাওয়া যাবে। রাতে ও সকালে লঞ্চ রয়েছে।",
                        R.drawable.hironone,
                        R.drawable.hirontwo,
                        R.drawable.hironthree,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        13,
                        "সুন্দরবনের করমজল",
                        "সরকারীভাবে পরিচালতি একমাত্র লবন পানির কুমির ও বিলুপ্ত প্রজাতির কচ্ছপ (বাটাগুড় বাল্কা) প্রজনন কেন্দ্র। এটি বানিশান্তা  ইউনিয়ন সংলগ্ন সুন্দরবনে অবস্থিত। এখানে পর্যটক সরাসরি পূর্বানুমতি ছাড়া যেকোন সময় সুন্দরবন সম্পর্কে সম্মক ধারনা ও জ্ঞান লাভ করতে পারেন। প্রাকৃতিক পরিবেশে চিত্রল হরিণ, বানর ও কুমির দেখার সুযোগ রয়েছে। সুন্দরবনের অভ্যন্তরীন চিত্র অবলোকনের জন্য দেড় কিলোমিটার কাঠের ট্রিল আছে। উপরের চিত্র দেখার জন্য ৪৫ ফুট উচু একটি আরসিসি টাওয়ার আছে। জলজ প্রাণী সম্পর্কে জানার জন্য ডলপিন ডিসপ্লে, চিত্রল হরিণের চামড়া, বাঘের কঙ্কাল, কুমিরের ডিম, বিবিধ শ্রেণীর উদ্ভিদ চেনার জন্য আঞ্চলিক, প্রচলিত ও বৈজ্ঞানিক নামের নেমপ্লেট, সুন্দরবনের মানচিত্র, ৩টি বড় কুমির যথাক্রমে রোমিও (পুরুষ), জুলিয়েট ও পিলপিল (নারী)  রয়েছে। দায়িত্বপ্র্রাপ্ত বৈজ্ঞানিক কর্মকর্তার তত্বাবধানে এই মুহুর্তে ২১৭টি বিভিন্ন বয়স ও আকারের কুমির রয়েছে। ২ মিটার দৈর্ঘ্য হলে কুমিরের বাচ্ছা নদীতে অবমুক্ত করা হয়। পর্যটক ওঠা নামার জন্য রয়েছে ২টি সুদৃশ্য আধুনিক ঘাট।দাকোপ উপজেলা সদর থেকে করমজলের দুরত্ব ৩০ কি:মি:, জেলা শহর থেকে ৫৫ কি:মি:। এখানে নৌপথ ও সড়ক পথে সহজেই ভ্রমন করা যায়। তাছাড়া রাত্রিযাপন করার জন্য নিকস্থ রিসোর্ট রয়েছে। স্বল্প খরচে প্রকৃতির এই লীলাভূমি খুব সহজেই ভ্রমন করা যায়। ",
                        "দাকোপ উপজেলা সদর থেকে করমজলের দুরত্ব ৩০ কি:মি:, জেলা শহর থেকে ৫৫ কি:মি:। এখানে নৌপথ ও সড়ক পথে সহজেই ভ্রমন করা যায়।",
                        R.drawable.koromonew,
                        R.drawable.kotkatwo,
                        R.drawable.koromthree,
                        22.428060,
                        89.588885
                )
        );
        placesList.add(
                new Places(
                        14,
                        "খান জাহান আলী সেতু",
                        "রূপচাঁদ সাহার কাটা খালটি আজ বিশাল রূপসা নদী। যা দেখে জীবনানন্দ দাশ মুগ্ধ হয়ে লিখেছিলেন  ‘‘রূপসার ঘোলা জলে হয়তো কিশোর এক সাদা ছেড়া পালে  ডিঙ্গা  বায়;  রাঙা   মেঘ সাঁতরায়ে অন্ধকারে আসিতেছে নীড়ে ’’ সেই রূপসা নদীর ওপর একটি সেতু  হয়েছে  লোকে  বলে  রূপসা  সেতু। পোশাকি  নাম খানজাহান আলী সেতু। সেতুর পশ্চিম প্রান্তের নদীর  পাড়ে নগর জীবনে হাঁপিয়ে  ওঠা মানুষ  ভিড়  জমায় প্রতিদিন।  বিশেষ করে শুক্রবার জায়গাটি হয়ে ওঠে মানুষের মিলনমেলা।",
                        "খুলনা শহর থেকে ইজিবাইক বা রিক্সায় খানজাহান আলী সেতু-তে যা্ওয়া যায়",
                        R.drawable.khanthree,
                        R.drawable.khantwo,
                        R.drawable.khanone,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        15,
                        "চুকনগর বদ্ধভূমি",
                        "বাংলাদেশের মুক্তিযুদ্ধই নয়, পৃথিবীর ইতিহাসে জঘন্যতম যেসব গণহত্যা সংঘটিত হয়েছে, সেগুলোর মধ্যে একটি চুকনগর গণহত্যা। ১৯৭১ সালের ২০ মে মহান মুক্তিযুদ্ধ চলাকালে খুলনার ডুমুরিয়ার ছোট্র শহর চুকনগরে পাকিস্তানি বর্বর সেনারা নির্মম এ হত্যাকান্ড ঘটায়। অতর্কিত এ হামলা চালিয়ে মুক্তিকামী ১০-১২ হাজার মানুষকে নির্বিচারে হত্যা করে তারা। মুক্তিযুদ্ধে পাকিস্তানি সেনারা যে নির্মম অত্যাচার, নির\u200Cযাতন ও হত্যাযজ্ঞ চালিয়েছে, তারও এক নীরব সাক্ষী হয়ে আছে আজকের চুকনগর। ওই দিন যাদের হত্যা করা হয়েছে, তাদের বেশিরভাগ পুরুষ হলেও বহু নারী ও শিশুকেও হত্যা করে পাকিস্তানি সেনারা। পাকিস্তানি বাহিনীর অত্যাচার সহ্য করতে না পেরে দক্ষিণাঞ্চলের জনগোষ্ঠী বাঁচার তাগিদে ভারতে যাবার সিদ্ধান্ত নেয়। মে মাসের মাঝামাঝি সময় বৃহত্তর খুলনার বাগেরহাট, রামপাল, মোড়েলগঞ্জ, কচুয়া, শরণখোলা, মংলা, দাকোপ, বটিয়াঘাটা, চালনা, ফরিদপুর, বরিশালসহ বিভিন্ন অঞ্চলের হাজার হাজার মানুষ ভারতে যাবার উদ্দেশে রওনা হন। ভারতে যাবার জন্যে তারা ট্রানজিট হিসেবে বেছে নেন ডুমুরিয়ার চুকনগরকে। ১৯মে রাতে সবাই চুনগরে এসে পৌঁছান। পরদিন সকালে সাতক্ষীরা এবং কলারোয়ার বিভিন্ন সীমান্ত দিয়ে ভারতে প্রবেশ করার জন্য চুকনগরে সমাবেত হন কিন্তু ২০মে সকাল ১০টার দিকে ৩টি ট্রাকে করে হঠাৎ পাকিস্তানি সেনারা চুকনগর বাজারের ঝাউতলায় (তৎকালীন পাতখোলা) এসে থামে। তাদের সঙ্গে ছিল হালকা মেশিনগান ও সেমি-অটোমেটিক রাইফেল। সাদা পোশাকে মুখঢাকা লোকজনও আসে। দুপুর ৩টা পর\u200Cযন্ত তারা নির্বিচারে মানুষ হত্যা করতে থাকে। হত্যাযজ্ঞ থেকে বাঁচার আশায় অনেকে নদীতে লাফিয়ে পড়ে ডুবে মারা যান। লাশের গন্ধে ভারি হয়ে যায় চুকনগর ও এর আশপাশের বাতাস। মাঠে, ক্ষেতে, খালে-বিলে পড়ে থাকে লাশ আর লাশ। এসব স্থান থেকে লাশ নিয়ে নদীতে ফেলার কাজ শুরু করেন স্থানীয়রা। চুকনগরের ফসলি জমিগুলোয় আজও পাওয়া যায় সেদিনের শহীদদের হাড়গোড়, তাদের শরীরে থাকা বিভিন্ন অলঙ্কার।",
                        "খুলনা শহর থেকে বাস বা মাহেন্দ্র-তে চুকনগর বদ্ধভূমি যাওয়া যায়",
                        R.drawable.chukone,
                        R.drawable.chuktwo,
                        R.drawable.chukthree,
                        0.00000,
                        0.000000
                )
        );
        placesList.add(
                new Places(
                        16,
                        "ষাট গম্বুজ মসজিদ ",
                        "ষাট গম্বুজ মসজিদ (Shaat Gombuj Mosque) খুলনা বিভাগের বাগেরহাট জেলায় অবস্থিত বাংলাদেশের একটি বিশ্ব ঐতিহ্যবাহী মসজিদ। মসজিদটির কোন শিলালিপি না থাকায় ষাট গম্বুজ মসজিদের প্রতিষ্টাতা ও নির্মাণকাল সম্পর্কে সঠিক কোনো তথ্য পাওয়া যায়নি। তবে মসজিদের স্থাপত্যশৈলী দেখে খান-ই-জাহান ১৫০০ শতাব্দীতে এটি নির্মাণ করেছিলেন বলে ধারণা করা হয়। এ মসজিদে ব্যবহৃত পাথরগুলো রাজমহল থেকে আনা হয়েছিলো। ষাট গম্বুজ মসজিদটি বাংলাদেশের বিশ্ব ঐতিহ্যবাহী স্থানগুলোর মধ্যে অন্যতম। ইউনেস্কো ১৯৮৩ খ্রিস্টাব্দে বাগেরহাট শহরটিকেই বিশ্ব ঐতিহ্যবাহী স্থানের মর্যাদা দেয়। ষাট গম্বুজ মসজিদ প্রাঙ্গনে প্রবেশ করতে জনপ্রতি ২০ টাকায় টিকেট করতে হয়। বিদেশি দর্শনার্থীর জন্যে প্রবেশ টিকেটের মূল্য দুইশত টাকা। (সময়ের সাথে টিকেটের মূল্য পরিবর্তনযোগ্য রবিবারে পূর্ণ দিন কেল্লা বন্ধ থাকে এবং সোমবার খোলা হয় বেলা ২.০০ থেকে। গরমকালে কেল্লা খোলা থাকে সকাল ১০ টা থেকে সন্ধ্যা ৬টা পর্যন্ত। শীতকালে কেল্লা খোলা হয় সকাল ৯টায় থেকে আর বিকেল ৫ টায় বন্ধ করা হয়। শীত ও গরমকাল উভয় সময়ই দুপুর ১টা থেকে ১.৩০ পর্যন্ত কেল্লা বন্ধ রাখা হয়। তবে শুক্রবারে জুম্মার নামাযের জন্যে ১২ টা ৩০ মিনিট থেকে থেকে ৩ টা ৩০ মিনিট পর্যন্ত কেল্লা বন্ধ থাকে।",
                        "ঢাকার সায়দাবাদ বাস টার্মিনাল থেকে প্রতিদিন সকাল ৬টা থেকে ১০টা এবং সন্ধা ৭ টা থেকে রাত ১০ টা পর্যন্ত মেঘনা, বনফূল, ফাল্গুনী, আরা, পর্যটক, বলেশ্বর, হামিম ও দোলা পরিবহণের বেশ কিছু বাস ছেড়ে যায়। গাবতলী বাস টার্মিনাল থেকে সোহাগ, শাকুরা, হানিফ ও ইগল পরিবহণের গাড়ি ছাড়ে। এই বাসগুলোতে জনপ্রতি ৩০০ থেকে ৪০০ টাকা ভাড়া লাগে। বাগেরহাট বাস স্ট্যান্ড থেকে মাত্র ৩০ থেকে ৪০ টাকা রিকশা ভাড়ায় ষাটগম্বুজ মসজিদে যাওয়া যায়।\n" +
                                "এছাড়া ঢাকা থেকে খুলনাগামী আন্তঃনগর ট্রেন সুন্দরবন এক্সপ্রেসে খুলনা এসে সেখান থেকে বাসে বা সিএনজি তে করে করে ষাট গম্বুজ মসজিদ যেতে পারবেন। খুলনা থেকে সময় লাগবে এক থেকে দেড় ঘন্টার মত।\n",
                        R.drawable.shatgombuzone,
                        R.drawable.shattwo,
                        R.drawable.shatthree,
                        0.00000,
                        0.000000
                )
        );


    }
}
